# CanTotalByAssemblyType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..CanTotalByAssemblyType Method
ScheduleField Class See Also
---
Indicates if totals by assembly type can be enabled for this field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool CanTotalByAssemblyType()
```

Visual Basic
---
```text
Public Function CanTotalByAssemblyType As Boolean
```

Visual C++
---
```text
public:
bool CanTotalByAssemblyType()
```

# ### Return Value
True if this field can be totaled by assembly type, false otherwise.
# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace